Revit 2024 API
RuledFace.Curve Property
Profile curves of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Curve this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property Curve ( _
	index As Integer _
) As Curve
	Get
Visual C++
public:
property Curve^ Curve[int index] {
	Curve^ get (int index);
}
Parameters
index
Type: System.Int32
See Also
RuledFace Class
Autodesk.Revit.DB Namespace